alessio9008/Thingsquare-Contiki-O.S-Porting-STM32F4-Discovery/platform/mist-spirit1/dev/spirit1/SPIRIT_Regs.h
#define	PCKTCTRL3_RX_MODE_NORMAL				((uint8_t)0x00) /*!< Normal RX Mode */
#define	PCKTCTRL3_RX_MODE_DIRECT_FIFO				((uint8_t)0x10) /*!< RX Direct Mode; data available through FIFO */
#define	PCKTCTRL3_RX_MODE_DIRECT_GPIO				((uint8_t)0x20) /*!< RX Direct Mode; data available through selected GPIO */

#define PCKTCTRL3_PKT_FRMT_MASK                                 ((uint8_t)0xC0)
#define PCKTCTRL3_RX_MODE_MASK                                  ((uint8_t)0x30)
#define PCKTCTRL3_LEN_WID_MASK                                  ((uint8_t)0x0F)

/**
 * @}
 */

/** @defgroup PCKTCTRL2_Register
 * @{
 */

/**
 *  \brief PCKTCTRL2 register
 *  \code
 *   Read Write
 *   Default value: 0x1E
 *
 *   7:3   PREAMBLE_LENGTH[4:0]: length of preamble field in bytes (0..31)
 *
 *
 *   2:1   SYNC_LENGTH[1:0]: length of sync field in bytes
 *
 *
 *   0     FIX_VAR_LEN: fixed/variable packet length
 *                       1 - Variable
 *                       0 - Fixed
 *   \endcode
 */
#define	PCKTCTRL2_BASE						((uint8_t)0x32) /*!< length of preamble and sync fields (in bytes), fix or variable packet length */
   
#define	PCKTCTRL2_FIX_VAR_LEN_MASK				((uint8_t)0x01) /*!< Enable/disable the length mode */
#define PCKTCTRL2_PREAMBLE_LENGTH_MASK                          ((uint8_t)0xF8)
#define PCKTCTRL2_SYNC_LENGTH_MASK                              ((uint8_t)0x06)

/**
 * @}
 */

/** @defgroup PCKTCTRL1_Register
 * @{
 */

/**
 *  \brief PCKTCTRL1 register
 *  \code
 *   Read Write
 *   Default value: 0x20
 *
 *   7:5   CRC_MODE[2:0]: CRC type (0, 8, 16, 24 bits)
 *
 *          CRC_MODE2     |       CRC_MODE1     |        CRC_MODE0     |       CRC Mode  (n. bits - poly)
 *       -------------------------------------------------------------------------------------------------
 *             0           |         0          |          1           |       8 - 0x07
 *             0           |         1          |          0           |       16 -  0x8005
 *             0           |         1          |          1           |       16 - 0x1021
 *             1           |         0          |          0           |       24 - 0x864CBF
 *
 *   4     WHIT_EN[0]: Enable Whitening
 *                       1 - Enable
 *                       0 - Disable
 *
 *   3:2   TX_SOURCE[1:0]: length of sync field in bytes
 *
 *          TX_SOURCE1     |        TX_SOURCE0     |        Tx Mode
 *       --------------------------------------------------------------------
 *             0           |           0           |       normal
 *             0           |           1           |       direct through FIFO
 *             1           |           0           |       direct through GPIO
 *             1           |           1           |       pn9
 *
 *   1   NOT_USED
 *
 *   0   FEC_EN: enable FEC
 *                       1 - FEC in TX , Viterbi decoding in RX
 *                       0 - Disabled
 *   \endcode
 */
#define	PCKTCTRL1_BASE						((uint8_t)0x33) /*!< CRC type, whitening enable, TX mode */

#define	PCKTCTRL1_FEC_MASK					((uint8_t)0x01) /*!< Enable/disable the Forward Error Correction */
#define PCKTCTRL1_TX_SOURCE_MASK                                ((uint8_t)0x0C) /*!< TX source mode */
#define PCKTCTRL1_CRC_MODE_MASK                                 ((uint8_t)0xE0) /*!< CRC type */
#define PCKTCTRL1_WHIT_MASK                                     ((uint8_t)0x10) /*!< Enable/disable the Whitening */

/**
 * @}
 */



/** @defgroup PCKTLEN1_Register
 * @{
 */

/**
 *  \brief PCKTLEN1 register
 *  \code
 *   Read Write
 *   Default value: 0x00
 *
 *   7:0   pktlen1[7:0]: lenght of packet in bytes (upper field) LENGHT/256
 *   \endcode
 */
#define	PCKTLEN1_BASE						((uint8_t)0x34) /*!< lenght of packet in bytes (upper field) */

/**
 * @}
 */

/** @defgroup PCKTLEN0_Register
 * @{
 */

/**
 *  \brief PCKTLEN0 register
 *  \code
 *   Read Write
 *   Default value: 0x14
 *
 *   7:0   pktlen0[7:0]: lenght of packet in bytes (lower field) LENGHT%256
 *   \endcode
 */
#define	PCKTLEN0_BASE						((uint8_t)0x35) /*!< lenght of packet in bytes (lower field) [PCKTLEN=PCKTLEN1x256+PCKTLEN0]*/

/**
 * @}
 */

/** @defgroup SYNCx_Registers
 * @{
 */
/**
 *  \brief SYNCx[4:1] Registers
 *  \code
 *   Read Write
 *   Default value: 0x88
 *
 *   7:0   SYNCx[7:0]: xth sync word
 *   \endcode
 */
#define	SYNC4_BASE						((uint8_t)0x36) /*!< Sync word 4 */
#define	SYNC3_BASE						((uint8_t)0x37) /*!< Sync word 3 */
#define	SYNC2_BASE						((uint8_t)0x38) /*!< Sync word 2 */
#define	SYNC1_BASE						((uint8_t)0x39) /*!< Sync word 1 */

/**
 * @}
 */


/** @defgroup MBUS_PRMBL_Register
 * @{
 */

/**
 *  \brief MBUS_PRMBL register
 *  \code
 *   Read Write
 *   Default value: 0x20
 *
 *   7:0 MBUS_PRMBL[7:0]: MBUS preamble control
 *   \endcode
 */
#define	MBUS_PRMBL_BASE						((uint8_t)0x3B) /*!< MBUS preamble lenght (in 01 bit pairs) */

/**
 * @}
 */


/** @defgroup MBUS_PSTMBL_Register
 * @{
 */

/**
 *  \brief MBUS_PSTMBL register
 *  \code
 *   Read Write
 *   Default value: 0x20
 *
 *   7:0 MBUS_PSTMBL[7:0]: MBUS postamble control
 *   \endcode
 */
#define	MBUS_PSTMBL_BASE					((uint8_t)0x3C) /*!< MBUS postamble length (in 01 bit pairs) */

/**
 * @}
 */

/** @defgroup MBUS_CTRL_Register
 * @{
 */

/**
 *  \brief MBUS_CTRL register
 *  \code
 *   Read Write
 *   Default value: 0x00
 *
 *   7:4   NOT_USED
 *
 *   3:1   MBUS_SUBMODE[2:0]: MBUS submode (allowed values are 0,1,3,5)
 *
 *   0     NOT_USED
 *   \endcode
 */
#define	MBUS_CTRL_BASE						((uint8_t)0x3D) /*!< MBUS sub-modes (S1, S2 short/long header, T1, T2, R2) */

#define	MBUS_CTRL_MBUS_SUBMODE_S1_S2L				((uint8_t)0x00) /*!< MBUS sub-modes S1 & S2L, header lenght min 279, sync 0x7696, Manchester */
#define	MBUS_CTRL_MBUS_SUBMODE_S2_S1M_T2_OTHER			((uint8_t)0x02) /*!< MBUS sub-modes S2, S1-m, T2 (only other to meter) short header, header lenght min 15, sync 0x7696, Manchester */
#define	MBUS_CTRL_MBUS_SUBMODE_T1_T2_METER			((uint8_t)0x06) /*!< MBUS sub-modes T1, T2 (only meter to other), header lenght min 19, sync 0x3D, 3 out of 6 */
#define	MBUS_CTRL_MBUS_SUBMODE_R2				((uint8_t)0x0A) /*!< MBUS sub-mode R2, header lenght min 39, sync 0x7696, Manchester */

/**
 * @}
 */



/** @defgroup PCKT_FLT_GOALS_CONTROLx_MASK_Registers
 * @{
 */

/**
 *  \brief PCKT_FLT_GOALS_CONTROLx_MASK  registers
 *  \code
 *   Default value: 0x00
 *   Read Write
 *   7:0    CONTROLx_MASK[7:0]:   All 0s - no filtering
 *
 *   \endcode
 */
#define	PCKT_FLT_GOALS_CONTROL0_MASK_BASE			((uint8_t)0x42) /*!< Packet control field #3 mask, all 0s -> no filtering */

#define	PCKT_FLT_GOALS_CONTROL1_MASK_BASE			((uint8_t)0x43) /*!< Packet control field #2 mask, all 0s -> no filtering */

#define	PCKT_FLT_GOALS_CONTROL2_MASK_BASE			((uint8_t)0x44) /*!< Packet control field #1 mask, all 0s -> no filtering */

#define	PCKT_FLT_GOALS_CONTROL3_MASK_BASE			((uint8_t)0x45) /*!< Packet control field #0 mask, all 0s -> no filtering */

/**
 * @}
 */

