alessio9008/Thingsquare-Contiki-O.S-Porting-STM32F4-Discovery/platform/mist-spirit1/dev/spirit1/SPIRIT_Regs.h
/** @defgroup RX_PCKT_LEN0
 * @{
 */

/**
 *  \brief RX_PCKT_LEN0  registers
 *  \code
 *   Default value: 0x00
 *   Read
 *
 *   7:0   RX_PCKT_LEN0[7:0]:  Length (number of bytes) of the received packet: RX_PCKT_LEN=RX_PCKT_LEN1 × 256 + RX_PCKT_LEN0
 *                             This value is packet_length%256
 *   \endcode
 */
#define	RX_PCKT_LEN0_BASE					((uint8_t)(0xCA)) /*!< RX_PCKT_LEN=RX_PCKT_LEN1 × 256 + RX_PCKT_LEN0 */

/**
 * @}
 */


/** @defgroup CRC_FIELD_Register
 * @{
 */

/**
 *  \brief CRC_FIELD[2:0]  registers
 *  \code
 *   Default value: 0x00
 *   Read
 *
 *   7:0   CRC_FIELDx[7:0]:    upper(x=2), middle(x=1) and lower(x=0) part of the crc field of the received packet
 *  \endcode
 */
#define	CRC_FIELD2_BASE						((uint8_t)(0xCB)) /*!< CRC2 field of the received packet */

#define	CRC_FIELD1_BASE						((uint8_t)(0xCC)) /*!< CRC1 field of the received packet */

#define	CRC_FIELD0_BASE						((uint8_t)(0xCD)) /*!< CRC0 field of the received packet */

/**
 * @}
 */

/** @defgroup RX_CTRL_FIELD_Register
 * @{
 */

/**
 *  \brief RX_CTRL_FIELD[3:0]  registers
 *  \code
 *   Default value: 0x00
 *   Read
 *
 *   7:0   RX_CTRL_FIELDx[7:0]:    upper(x=3), middle(x=2), middle(x=1) and lower(x=0) part of the control field of the received packet
 *   \endcode
 */
#define	RX_CTRL_FIELD0_BASE					((uint8_t)(0xCE)) /*!< CRTL3 Control field of the received packet */

#define	RX_CTRL_FIELD1_BASE					((uint8_t)(0xCF)) /*!< CRTL2 Control field of the received packet */

#define	RX_CTRL_FIELD2_BASE					((uint8_t)(0xD0)) /*!< CRTL1 Control field of the received packet */

#define	RX_CTRL_FIELD3_BASE					((uint8_t)(0xD1)) /*!< CRTL0 Control field of the received packet */

/**
 * @}
 */

/** @defgroup RX_ADDR_FIELD_Register
 * @{
 */

/**
 *  \brief RX_ADDR_FIELD[1:0]  registers
 *  \code
 *   Default value: 0x00
 *   Read
 *
 *   7:0   RX_ADDR_FIELDx[7:0]:    source(x=1) and destination(x=0) address field of the received packet
 *   \endcode
 */
#define	RX_ADDR_FIELD1_BASE					((uint8_t)(0xD2)) /*!< ADDR1 Address field of the received packet */

#define	RX_ADDR_FIELD0_BASE					((uint8_t)(0xD3)) /*!< ADDR0 Address field of the received packet */

/**
 * @}
 */

/**
 * @}
 */


/** @defgroup Protocol_Registers
 * @{
 */

/** @defgroup PROTOCOL2_Register
 * @{
 */

/**
 *  \brief PROTOCOL2  register
 *  \code
 *   Default value: 0x06
 *   Read Write
 *   7   CS_TIMEOUT_MASK:              1 - CS value contributes to timeout disabling
 *
 *   6   SQI_TIMEOUT_MASK:             1 - SQI value contributes to timeout disabling
 *
 *   5   PQI_TIMEOUT_MASK:             1 - PQI value contributes to timeout disabling
 *
 *   4:3  TX_SEQ_NUM_RELOAD[1:0]:      TX sequence number to be used when counting reset is required using the related command.
 *
 *   2   RCO_CALIBRATION[0]:           1 - Enables the automatic RCO calibration
 *
 *   1   VCO_CALIBRATION[0]:           1 - Enables the automatic VCO calibration
 *
 *   0   LDCR_MODE[0]:                 1 - LDCR mode enabled
 *
 *   \endcode
 */
#define	PROTOCOL2_BASE						((uint8_t)0x50) /*!< Protocol2 regisetr address */

#define	PROTOCOL2_LDC_MODE_MASK				        ((uint8_t)0x01) /*!< Enable/disable Low duty Cycle mode */
#define	PROTOCOL2_VCO_CALIBRATION_MASK			        ((uint8_t)0x02) /*!< Enable/disable VCO automatic calibration */
#define	PROTOCOL2_RCO_CALIBRATION_MASK			        ((uint8_t)0x04) /*!< Enable/disable RCO automatic calibration */
#define	PROTOCOL2_PQI_TIMEOUT_MASK			        ((uint8_t)0x20) /*!< PQI value contributes to timeout disabling */
#define	PROTOCOL2_SQI_TIMEOUT_MASK			        ((uint8_t)0x40) /*!< SQI value contributes to timeout disabling */
#define	PROTOCOL2_CS_TIMEOUT_MASK			        ((uint8_t)0x80) /*!< CS value contributes to timeout disabling */
  
/**
 * @}
 */

/** @defgroup PROTOCOL1_Register
 * @{
 */

/**
 *  \brief PROTOCOL1  register
 *  \code
 *   Default value: 0x00
 *   Read Write
 *   7   LDCR_RELOAD_ON_SYNC:          1 - LDCR timer will be reloaded with the value stored in the LDCR_RELOAD registers
 *
 *   6   PIGGYBACKING:                 1 - PIGGYBACKING enabled
 *
 *   5:4   Reserved.
 *
 *   3   SEED_RELOAD[0]:               1 - Reload the back-off random generator
 *                                        seed using the value written in the
 *                                        BU_COUNTER_SEED_MSByte / LSByte registers
 *
 *   2   CSMA_ON   [0]:                1 - CSMA channel access mode enabled
 *
 *   1   CSMA_PERS_ON[0]:              1 - CSMA persistent (no back-off) enabled
 *
 *   0   AUTO_PCKT_FLT[0]:             1 - automatic packet filtering mode enabled
 *
 *   \endcode
 */
#define	PROTOCOL1_BASE						((uint8_t)0x51) /*!< Protocol1 regisetr address */

#define	PROTOCOL1_AUTO_PCKT_FLT_MASK				((uint8_t)0x01) /*!< Enable/disable automatic packet filtering mode */
#define	PROTOCOL1_CSMA_PERS_ON_MASK				((uint8_t)0x02) /*!< Enable/disable CSMA persistent (no back-off)  */
#define	PROTOCOL1_CSMA_ON_MASK				        ((uint8_t)0x04) /*!< Enable/disable CSMA channel access mode */
#define	PROTOCOL1_SEED_RELOAD_MASK				((uint8_t)0x08) /*!< Reloads the seed of the PN generator for CSMA procedure */
#define	PROTOCOL1_PIGGYBACKING_MASK				((uint8_t)0x40) /*!< Enable/disable Piggybacking */
#define	PROTOCOL1_LDC_RELOAD_ON_SYNC_MASK			((uint8_t)0x80) /*!< LDC timer will be reloaded with the value stored in the LDC_RELOAD registers */

/**
 * @}
 */

/** @defgroup PROTOCOL0_Register
 * @{
 */

/**
 *  \brief PROTOCOL0  register
 *  \code
 *   Default value: 0x08
 *   Read Write
 *   7:4   NMAX_RETX[3:0]:             Max number of re-TX.  0 - re-transmission is not performed
 *
 *   3     NACK_TX[0]:                 1 - field NO_ACK=1 on transmitted packet
 *
 *   2     AUTO_ACK[0]:                1 - automatic ack after RX
 *
 *   1     PERS_RX[0]:                 1 - persistent reception enabled
 *
 *   0     PERS_TX[0]:                 1 - persistent transmission enabled
 *
 *   \endcode
 */
#define	PROTOCOL0_BASE						((uint8_t)0x52) /*!< Persistent RX/TX, autoack, Max number of retransmissions */

#define	PROTOCOL0_PERS_TX_MASK				        ((uint8_t)0x01) /*!< Enables persistent transmission */
#define	PROTOCOL0_PERS_RX_MASK				        ((uint8_t)0x02) /*!< Enables persistent reception */
#define	PROTOCOL0_AUTO_ACK_MASK				        ((uint8_t)0x04) /*!< Enables auto acknowlegment */
#define	PROTOCOL0_NACK_TX_MASK				        ((uint8_t)0x08) /*!< Writes field NO_ACK=1 on transmitted packet */
#define	PROTOCOL0_NMAX_RETX_MASK                                ((uint8_t)0xF0) /*!< Retransmission mask */

/**
 * @}
 */

/** @defgroup TIMERS5_Register
 * @{
 */

/**
 *  \brief TIMERS5  register
 *  \code
 *   Default value: 0x00
 *   Read Write
 *   7:0   RX_TIMEOUT_PRESCALER[7:0] :             RX operation timeout: prescaler value
 *   \endcode
 */
#define	TIMERS5_RX_TIMEOUT_PRESCALER_BASE			((uint8_t)0x53) /*!< RX operation timeout: prescaler value */

/**
 * @}
 */

